# SetOpenConnectorIndicatorPlanColor Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIFabricationUtils..::..SetOpenConnectorIndicatorPlanColor Method
UIFabricationUtils Class See Also
---
Sets the color of the open connector indicator in plan view.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static void SetOpenConnectorIndicatorPlanColor(
	Color color
)
```

Visual Basic
---
```text
Public Shared Sub SetOpenConnectorIndicatorPlanColor ( _
	color As Color _
)
```

Visual C++
---
```text
public:
static void SetOpenConnectorIndicatorPlanColor(
	Color^ color
)
```

# ### Parameters
color
    Type: Autodesk.Revit.DB..::..Color
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
UIFabricationUtils Class
Autodesk.Revit.UI Namespace